w-dee/esp-np2kai/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Phase 3: enable the pinned ESP-IDF PSRAM heap and external BSS support.
# Keep the P4 mode/speed defaults from ESP-IDF 5.5.4.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Step 6A.1: the approved common validation envelope is 8 MiB.  The raw
# NP2TEST fixture remains at its reviewed offset and the application remains
# in the expanded 2 MiB factory partition.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Storage/FATFS contract.  The neutral component limit also accommodates
# content-addressed fixture names containing a full SHA-256 digest.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_MAX_LFN=128
CONFIG_FATFS_SECTOR_4096=y
CONFIG_WL_SECTOR_SIZE_4096=y
